Smart4J Framework学习/demo/src/main/resources/wss4j_inbound_message3.xml

<!-- 基于数字签名的身份认证的请求 -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-0abe2129-d903-4e04-8186-08f281d476c4">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#id-789a2a0c-ecf8-4f54-9aba-124068c27881">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                        PrefixList=""/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>4XABwHq7j6TbhW29suiKl/MsgTE=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>
                    P2UkERowHuLXRz5OhcNFkesy/gquVUy+X2YAhxp/3ErdtlACM1MmBjQKjC6SXetmoXRqjmGaBxXK1nJV4t72ah0N0jmJBb9f0gqWSnaWI9quZds5607tMVGcqxaa6i/qswM9VPFZwD5fmL85Ks7HNZikw9vhe29pRrlpf+qUIOcZw+SXJcmI+JqaZqZbjXRtZGjS8ICfn8StMd1/i+FUmdgxBilGnmHKEmT3qhpjmjsak/5uBb6Vn+n4JFWXkC0lfeHeoSMi8o76ViX4Qw3oiCaGYkVaNAKYuxfHMuercAikbVVlfjroxQi2OwYG8hN5y/XsU7ycY5ffYidRMZAoRw==
                </ds:SignatureValue>
                <ds:KeyInfo Id="KI-2dd6ac7c-4bf0-498e-bc38-336b10a6e238">
                    <wsse:SecurityTokenReference wsu:Id="STR-288c43fd-afde-48ea-8a9e-960f3fd23e95">
                        <ds:X509Data>
                            <ds:X509IssuerSerial>
                                <ds:X509IssuerName>CN=client</ds:X509IssuerName>
                                <ds:X509SerialNumber>1329393975</ds:X509SerialNumber>
                            </ds:X509IssuerSerial>
                        </ds:X509Data>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </SOAP-ENV:Header>
    <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
               wsu:Id="id-789a2a0c-ecf8-4f54-9aba-124068c27881">
        <ns2:greet xmlns:ns2="http://soap_spring_cxf_wss4j.ws.demo/">
            <arg0>Jack</arg0>
        </ns2:greet>
    </soap:Body>
</soap:Envelope>